юв_гит_/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <basedOn>Document.ЗаказВМастерскую</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ПроизводствоИзделий</registerRecords>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Потребность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>ТипНоменклатуры</name>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзСпецификации</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОпераций</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Нормочасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

юв_гит_/src/AccumulationRegisters/ПроизводствоИзделий/ПроизводствоИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПроизводствоИзделий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроизводствоИзделия</name>
    <type>
      <types>DocumentRef.Производство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

юв_гит_/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

юв_гит_/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Заготовка</name>
  </enumValues>
  <enumValues>
    <name>ГотовоеИзделие</name>
  </enumValues>
</mdclass:Enum>

юв_гит_/src/Documents/Производство/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказВМастерскую") Тогда
		// Заполнение шапки
		Изделие = ДанныеЗаполнения.Изделие;
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		Потребность = ДанныеЗаполнения.Потребность;
		Спецификация = ДанныеЗаполнения.Спецификация;
		Для Каждого ТекСтрокаМатериалы Из ДанныеЗаполнения.Материалы Цикл
			Если ТекСтрокаМатериалы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда
				НоваяСтрока = Материалы.Добавить();
				НоваяСтрока.ЕдИзм = ТекСтрокаМатериалы.ЕдИзм;
				НоваяСтрока.ИзСпецификации = ТекСтрокаМатериалы.ИзСпецификации;
				НоваяСтрока.Количество = ТекСтрокаМатериалы.Количество;
				НоваяСтрока.Материал = ТекСтрокаМатериалы.Материал;
				НоваяСтрока.ТипНоменклатуры = ТекСтрокаМатериалы.ТипНоменклатуры;			
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрокаОперации Из ДанныеЗаполнения.Операции Цикл
			НоваяСтрока = Операции.Добавить();
			НоваяСтрока.КоличествоОпераций = ТекСтрокаОперации.КоличествоОпераций;
			НоваяСтрока.НормаВремени = ТекСтрокаОперации.НормаВремени;
			НоваяСтрока.Нормочасы = ТекСтрокаОперации.Нормочасы;
			НоваяСтрока.Операция = ТекСтрокаОперации.Операция;
			НоваяСтрока.РабочееМесто = ТекСтрокаОперации.РабочееМесто;
			НоваяСтрока.Спецификация = ТекСтрокаОперации.Спецификация;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПроизводствоИзделий Расход
	Движения.ПроизводствоИзделий.Записывать = Истина;
	Движение = Движения.ПроизводствоИзделий.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Изделие = Изделие;
	Движение.Спецификация = Спецификация;
	Движение.ЗаказКлиента = ЗаказКлиента;
	Движение.ПроизводствоИзделия = Ссылка;
	Движение.Количество = Потребность;

	// регистр ОстаткиМатериалов Расход 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоМатериалы.Материал КАК Материал,
		|	СУММА(ПроизводствоМатериалы.Количество) КАК Количество
		|ПОМЕСТИТЬ Док
		|ИЗ
		|	Документ.Производство.Материалы КАК ПроизводствоМатериалы
		|ГДЕ
		|	ПроизводствоМатериалы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводствоМатериалы.Материал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиМатериаловОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ Рег
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(&Дата, ) КАК ОстаткиМатериаловОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Док.Материал КАК Материал,
		|	Док.Количество КАК Количество,
		|	ЕСТЬNULL(Рег.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	Док.Количество / Рег.КоличествоОстаток * Рег.СуммаОстаток КАК Сумма
		|ИЗ
		|	Док КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ Рег КАК Рег
		|		ПО Док.Материал = Рег.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			Сообщить("Мало материалов " + Выборка.Материал + ",не хватает "
			+ (Выборка.Количество - Выборка.КоличествоОстаток));
			Отказ = Истина;
		КонецЕсли;
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
	КонецЦикла; 
	
	тз_Материалы = РезультатЗапроса.Выгрузить();
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из тз_Материалы Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериалы.Материал;
        Движение.Количество = ТекСтрокаМатериалы.Количество;
		Движение.Сумма = ТекСтрокаМатериалы.Сумма; 
	КонецЦикла;
КонецПроцедуры
